{"[g_start]":0,"[g_end]":1,"[unknown]":2,"[pad]":3," ":4,"#":5,"+":6,"-":7,".":8,"0":9,"1":10,"2":11,"3":12,"4":13,"5":14,"6":15,"7":16,"8":17,"9":18,"=":19,"B":20,"K":21,"N":22,"O":23,"Q":24,"R":25,"[":26,"]":27,"_":28,"a":29,"b":30,"c":31,"d":32,"e":33,"f":34,"g":35,"h":36,"n":37,"r":38,"s":39,"t":40,"x":41," 1":42," 2":43," N":44," 3":45," R":46," B":47," Q":48,"1.":49,"4.":50,"5.":51,"xd":52,"6.":53,"7.":54,"8.":55,"+ ":56,"9.":57,"0.":58,"2.":59,"3.":60,"xe":61," 4":62,"f6":63,"xc":64,"f3":65," K":66,"g_":67,"-O":68,"O-O":69,"d4":70,"e4":71," c":72,"f4":73,"c3":74,"f5":75,"e5":76," d":77,"d7":78,"xb":79,"g5":80,"e6":81," 5":82,"e7":83,"e3":84,"c4":85,"e2":86,"g4":87,"d2":88,"g6":89,"xd4":90,"c6":91,"d3":92,"xd5":93,"g3":94," b":95," a":96," Nf6":97,"Nf3":98,"g7":99,"ar":100,"en":101,"st":102,"g_en":103,"g_st":104,"art":105,"g_end":106,"g_start":107," 2.":108," 3.":109," 4.":110," 5.":111," 7.":112," 8.":113," 9.":114," 6.":115," 10.":116," 11.":117,"d5":118," 12.":119," 13.":120," 14.":121," 15.":122," h":123," 16.":124," 17.":125," 18.":126,"b3":127," 19.":128,"xe5":129," 20.":130,"e8":131," 21.":132," O-O":133,"a4":134,"e1":135,"Nc3":136," 22.":137,"b4":138," 23.":139,"h4":140,"d6":141,"c7":142,"d1":143," 24.":144,"c5":145,"d8":146," 25.":147,"g2":148,"xe4":149,"h3":150," 26.":151,"c8":152,"f8":153," 27.":154,"Ra":155,"f7":156,"f2":157," 28.":158,"c2":159," Ra":160," 29.":161," Nc6":162," c5":163,"b6":164," 30.":165,"c1":166,"xa":167,"b5":168,"f1":169,"h5":170," 31.":171," d5":172," 32.":173," 33.":174," e6":175,"xf6":176,"b7":177," 6":178," 34.":179,"Kh":180," e5":181," 35.":182," g6":183,"xc4":184,"a3":185,"xc5":186,"b8":187,"xc3":188," d6":189," 36.":190,"b1":191," 37.":192,"a5":193,"h6":194,"xc6":195," Be7":196,"xf5":197," 38.":198,"Be3":199," a6":200," 39.":201," e":202,"Bd3":203,"xf3":204," Bg7":205," 40.":206,"xf4":207,"b2":208," b5":209,"g8":210," h6":211,"xb5":212," f5":213," 41.":214,"xe6":215,"xd6":216,"Be2":217," Qc7":218,"g1":219," 42.":220," c6":221,"Re1":222,"Bg5":223," a5":224," Re8":225," cxd4":226,"xb4":227,"xg5":228," 43.":229,"h7":230,"Qd2":231," b6":232," Nd7":233," Bd7":234,"a6":235," 44.":236,"Qe2":237,"Rf":238,"xg4":239,"Bg2":240," h5":241," 45.":242," Rc8":243,"Nxd4":244," Rf":245,"xd3":246," Bb7":247,"Rx":248," Be6":249," Nb":250,"Qc2":251,"xe3":252," f":253," 46.":254," g5":255,"h8":256," 47.":257,"Nd2":258," f6":259,"xe7":260,"xg6":261,"Rc1":262," Nbd7":263,"Kg2":264," Qe7":265,"Rd1":266,"Bd2":267,"Bc4":268,"Bf4":269,"Kf2":270," 48.":271,"xd7":272," Rd8":273," Rb8":274," Rx":275," 49.":276," g":277," 7":278,"xb3":279," Qb6":280," Bd6":281,"cxd5":282," Qd7":283," Bg4":284,"Ne5":285," 50.":286,"xb6":287,"xd2":288,"h2":289,"Bx":290,"Kh1":291,"Ne2":292,"xd8":293,"+[":294,"exd5":295," 51.":296," Bf5":297,"Kx":298,"Bb5":299,"Ke2":300," Ne7":301," Ne5":302,"Rb1":303," Bb4":304," Ne4":305," Kg7":306," Bx":307,"Nd5":308," 52.":309,"xe2":310," Nd5":311,"Nb":312,"Kf1":313,"Ne4":314,"Qd3":315," Kf7":316,"Kh2":317,"xd1":318," Qa5":319,"Qx":320," Nc5":321,"Qb3":322," 53.":323,"Ke3":324,"xb7":325,"xb2":326,"Bb2":327,"Qf3":328," Nb6":329,"Kf3":330," Bc5":331," exd5":332," Nxd5":333," b4":334," 54.":335,"Rad1":336,"Nd4":337," Ke7":338,"dxe5":339," Bf6":340,"Bxf6":341,"h1":342,"xa5":343,"xg3":344,"Nbd2":345,"xa6":346," 55.":347,"Bb3":348,"Qe3":349,"Nb3":350,"Kg1":351," Nd4":352,"a7":353,"Nxe4":354,"Bf3":355," 56.":356,"Rd2":357,"xc8":358," Rf8":359,"Ng5":360,"Ne3":361," Kf8":362," Qf6":363,"Nc4":364,"Kd3":365,"Kd2":366,"Rf1":367," Nxe5":368," Bc6":369,"O-O-O":370,"Kg3":371," dxe4":372,"Ng3":373," exd4":374,"bxc3":375," Qd8":376," e4":377," dxe5":378," 57.":379," Qd6":380,"xc2":381," Nxe4":382," Bf8":383," a4":384," Qx":385,"xe8":386,"xc7":387,"Nxe5":388," Ng4":389," Kf6":390,"Nx":391," c4":392," Ne6":393," Rd7":394,"xc1":395," dxc4":396," 58.":397," f4":398,"Rfd1":399,"cxd4":400,"Re2":401," Rad8":402,"dxc5":403," Bxc3":404," Rac8":405,"a2":406,"Nd3":407," Nh5":408,"Rac1":409," Ng6":410," Bxf3":411,"Kg7":412," Nf5":413," Rg8":414,"Bc2":415," d4":416,"Nb5":417,"xe1":418,"Rfe1":419,"xa3":420," Kh8":421,"Nf4":422," Ke6":423," Ra8":424," Nxd4":425," Rc7":426,"Ng":427," 59.":428," Nc4":429,"Bf1":430," h4":431," Ng":432," cxd5":433,"Qg3":434," Kx":435,"xa2":436,"xa7":437," Re7":438,"Kh8":439,"Bxc4":440," Na5":441,"Nxd5":442,"a8":443," Ba6":444," Rfd8":445," Ne8":446,"Bg3":447,"Qg4":448,"Kg8":449," 60.":450,"Rc2":451,"Qf2":452,"Re3":453," Nb4":454,"Rg1":455," Rfe8":456," Nx":457,"Bc3":458," Kd7":459,"fxe5":460,"Bd4":461,"Kf8":462," Kh7":463,"Nf5":464,"Rd3":465,"Ra1":466," Rf7":467,"Rh":468," Qc6":469,"Rd":470,"Rf2":471," g4":472,"Bh4":473,"Qc3":474," bxc6":475," Nf4":476," Na6":477," Nd6":478,"Bxc6":479,"Nxc6":480,"Ke4":481,"Kb1":482," Qe6":483," Kd6":484,"Qa4":485,"Nc5":486," Qc8":487," Qe8":488," Bg6":489,"Bxe4":490," 61.":491,"Na4":492," Nc7":493,"a1":494,"Kc2":495,"Rf3":496," Bxd5":497,"Be4":498,"Re":499,"Qxd4":500,"Kf7":501," Bc8":502,"Qd4":503,"Rc7":504," Nf8":505,"Qd1":506,"Kf4":507,"exf5":508,"Ke7":509," axb5":510,"Qf4":511,"Kh7":512," 8":513," Bxe5":514,"Qe1":515," Qc5":516,"Bxd4":517,"Rd7":518,"Qh5":519," O-O-O":520," Qxd5":521," Nxc3":522," Bd4":523," 62.":524,"Kd4":525," Nf":526," Kg6":527,"Bf2":528,"Qe4":529,"Bxd5":530," Be5":531," Qg5":532,"Kc3":533,"Nh4":534,"Rxd8":535," Bd5":536," Qb7":537," Kg8":538," fxe4":539," Re":540," exf4":541,"gx":542,"Nf1":543,"xa8":544," Rd":545," Rc2":546,"Nxf6":547,"Nd6":548,"axb5":549," 63.":550," Qf7":551,"axb4":552,"Qh4":553," Bb6":554,"Kf6":555,"Bh6":556,"Ra7":557," Rh":558,"Bd5":559,"Rae1":560,"exf6":561," Qe5":562,"Ke1":563," Re6":564," Qd5":565," Qg6":566," Qh4":567," Rd2":568,"Nc2":569,"Nge2":570,"Bxe5":571,"Bc1":572," Qf5":573," gx":574," Bxd4":575,"Nd":576," Bh6":577," Bxe4":578,"Ne1":579,"Ba4":580," gxf5":581," fxe6":582," Rh8":583," 64.":584," Ra7":585,"Rc3":586," axb4":587," Rc":588," Rf6":589,"Na3":590,"Qc1":591," Bxc5":592,"Rc":593," Rd6":594,"Rb7":595,"Bxe7":596," Ra2":597,"Bxg7":598,"Ba3":599,"Qc4":600," Bg5":601," Bxf6":602,"Kg6":603,"Rg3":604,"Re7":605,"Rd6":606,"Kg4":607," Rc6":608,"xa1":609," Nd3":610,"Kh3":611," Be8":612,"Rd4":613," Rb2":614," Qb8":615,"Rh1":616,"Be5":617," 65.":618," Be4":619," Kc7":620," Rae8":621,"Ke6":622," Bb5":623,"Qxd3":624," Rfc8":625,"exd4":626,"Nc6":627," Nge7":628," Rc4":629," Rb7":630," hxg5":631," Ke5":632," Bd8":633,"Qg5":634," Bh5":635,"Qxe4":636," Rb":637,"Ke5":638,"hxg4":639," Qh5":640," gxf6":641,"Rd8":642,"hxg5":643,"Qxd5":644,"Rxe8":645,"Bh3":646,"Ng4":647,"Kd7":648,"Kf5":649," Qb4":650,"Rb3":651,"Rb":652,"Bxf4":653,"Rxd5":654,"Kc4":655," 66.":656," Rxd1":657,"36.":658,"34.":659,"35.":660,"Bxc5":661,"37.":662,"38.":663,"Rab1":664," Bc7":665," Rc5":666,"Bc5":667,"39.":668,"Ra8":669,"Nxe6":670," Ra1":671,"40.":672,"33.":673," Qd4":674,"Rc6":675," bxc4":676," Rd5":677,"Qe5":678," Re2":679,"Qxf3":680,"Ra3":681,"32.":682,"Kd1":683,"Ra2":684," Rb6":685,"gxf3":686," Ra3":687," Bxf5":688,"Kd6":689,"Qd5":690,"gxf4":691," Nfd7":692,"Bxe6":693," Qxe5":694," Kxg7":695," Kc6":696,"Ra6":697,"31.":698,"cxb5":699," Kf5":700,"Nd1":701," Qxd4":702,"41.":703,"Rh3":704,"xb8":705,"Qb2":706," Rab8":707,"Re4":708," Rb4":709,"Bxf3":710,"Kg5":711," Rd4":712,"Rxd4":713," Bxd3":714,"gxf5":715," hxg4":716,"Rc8":717,"Kd5":718,"30.":719," Rd3":720," hxg6":721,"Bxd6":722," Rd1":723," bxc5":724," 67.":725," Qxd6":726," Qe4":727,"Rb6":728,"Rxd6":729,"Rd5":730,"Rxe5":731,"Rc5":732,"axb3":733," Nh6":734,"Bg4":735," Bc4":736," Rc3":737,"Rfc1":738,"Qh3":739,"Nc":740,"Bd1":741," Rc1":742,"Rc4":743,"29.":744," Kd5":745,"Nf2":746,"Rxf7":747,"Ne6":748,"Nf6":749,"Rxc8":750,"Rb2":751," Ke8":752,"Kb2":753," Re5":754,"#[":755,"Ke8":756,"Re5":757," Rg6":758," Ra6":759,"Rb8":760,"Bxf5":761," Qf4":762,"Qxc4":763," d3":764,"42.":765," fxe5":766,"xa4":767,"28.":768," Nb8":769,"fxe4":770," Nf7":771," Bxg2":772," Nxc5":773,"Bd6":774,"Re8":775," e3":776,"xb1":777," Rb3":778," 68.":779,"Rxe4":780,"27.":781,"bxc4":782," Bf7":783," Re4":784," exf5":785,"Rxd1":786," a3":787,"Kh6":788,"hxg6":789," Ra4":790," Ng5":791,"bxc5":792,"Rf4":793," Nxf3":794," Nxe3":795," Qg4":796,"43.":797,"Rxe6":798," Qb5":799," Qxe7":800,"Qxf6":801,"Bxd7":802," Rf5":803,"Bb4":804," Rb1":805,"Kxg2":806,"hxg3":807,"Qb4":808,"Rxb7":809,"26.":810,"Qf5":811,"Bd7":812,"exd6":813,"Rb5":814,"Rf7":815,"Kc5":816," Bxe3":817," Re1":818," Rxb2":819,"Ra5":820,"Be1":821,"Kb3":822,"Nxc5":823," Qc4":824,"Qxe5":825," Rxd4":826,"fxe3":827,"Nxd7":828,"Nh3":829,"44.":830," Nd":831," dxc5":832,"Bb1":833,"Ra4":834,"Qxd8":835," Bxc4":836," 69.":837," Nc":838," Qxc5":839,"Nxc4":840," Rg7":841,"Kc6":842," Qa6":843," Nxd3":844,"Nxd6":845," b3":846,"45.":847," Rxd5":848," Bxc6":849,"25.":850,"Qb5":851,"Kc7":852," Ra5":853,"Qh6":854,"Kc1":855," Nd8":856," Rxc3":857,"Rxd7":858," Ne3":859," Rxe1":860,"Bf5":861," Nxc4":862," Rxe4":863," Rxe5":864," Qxf6":865,"Rg2":866,"Nf":867," Rxc4":868," Rxc1":869,"46.":870," c3":871,"Qxc3":872," Qf8":873,"24.":874,"Re6":875," Nc3":876,"Rb4":877," Bd3":878,"dxe6":879,"Nxf5":880," Rxa2":881,"Qc5":882," f3":883," 70.":884,"Kd8":885," gxf4":886,"Qd6":887,"Qa3":888,"Qf6":889,"Rxe7":890," Bf4":891,"Qg2":892,"dxe4":893," Nxf6":894,"47.":895,"23.":896," Bxe2":897,"Rxa7":898," Qxb2":899,"Bc6":900," Qg7":901," Nh7":902," Nc8":903," Rb5":904,"Rxf8":905,"Qxd6":906,"Rxc6":907,"Rxf6":908,"dxc6":909,"Qb1":910,"Qe6":911," Rf4":912,"Be6":913," Bh3":914,"Nh2":915,"Bxb7":916,"Rxc5":917,"Nc1":918,"Rg7":919," Nxf4":920,"Qe7":921," axb6":922," Kb8":923,"Qxe6":924,"Qd7":925," Kc5":926,"Rh7":927," Bxf4":928," Qxe4":929," Qa7":930,"48.":931,"Qc7":932," Bxb2":933," Kg5":934,"Qxe3":935,"Rh8":936,"22.":937," h3":938," Re3":939," 71.":940,"Nxb5":941," Rf2":942," Rxc2":943,"Rh4":944,"49.":945,"Nb6":946,"Bxb5":947," Qh6":948," Qe3":949," Ngf6":950," Bxg5":951,"Bxg5":952," Rh6":953,"Rf6":954," Ng7":955,"Bb6":956," Ne":957," Kd8":958,"gxf6":959," Rxd8":960,"Qxe7":961," Bxd2":962," 9":963," cxb4":964,"Qxe2":965,"Rf8":966,"fxg5":967," Bc3":968,"Kb4":969,"Nb4":970,"Nxe7":971,"fxg6":972,"Qxb7":973,"Rxf5":974,"Kh4":975,"21.":976,"bxc6":977," Qa4":978,"Bxa6":979,"50.":980," Nb5":981,"Rxc7":982," Nf3":983,"Rg4":984," Rh1":985,"Rhe1":986,"Qc6":987," Qxc3":988," Rh2":989," Qd3":990,"Qf1":991," 72.":992,"Rf5":993," Rxf2":994," Qc2":995,"Qxd7":996,"Qxd2":997,"Qxf5":998,"Nb1":999,"Rxc4":1000,"Bxc3":1001," Ng8":1002," Rxe3":1003,"Rxc1":1004,"Rxa6":1005,"Nd7":1006," Qd2":1007,"20.":1008,"Nh5":1009,"Rxd3":1010," bxc3":1011,"Bxf7":1012,"Bxg6":1013,"51.":1014," Rg4":1015,"Nc7":1016,"Nxg6":1017,"Kb6":1018,"Rg8":1019," Rxf4":1020,"Ne":1021," fxg4":1022,"Kb5":1023," Na4":1024,"Rg5":1025,"Qxc5":1026," Nxb3":1027,"Rxf4":1028," Bxb5":1029," fxg6":1030," Be3":1031," Qc3":1032," Rh5":1033,"Rh2":1034," Rxf3":1035,"Qxc6":1036," Rxd6":1037," Rxd3":1038," Rxc5":1039," Ba5":1040,"Nxg5":1041,"19.":1042,"Ne7":1043," Bxg4":1044,"Qxf7":1045," Rf1":1046,"Rh6":1047,"Rxc3":1048," Rg5":1049,"R1":1050,"Na5":1051," Qe2":1052," Qxc4":1053,"Qxf4":1054," Rh7":1055," 73.":1056," Rg2":1057,"52.":1058," Rxd2":1059,"Bf6":1060," Qxc6":1061,"Qf7":1062," Bh4":1063," bxa4":1064," Rf3":1065,"Rxd2":1066," Nxd2":1067,"Bxh6":1068," Qxf4":1069," Kb7":1070," Rg1":1071,"Rxg7":1072,"Nxf4":1073," Ke4":1074,"Qd8":1075," dxc3":1076,"Nxf7":1077,"Ba2":1078,"Qg6":1079," exf3":1080," Kh6":1081,"Rxe1":1082," Bxd6":1083," Rxf5":1084," Qxa2":1085," Nxg3":1086," Bxe6":1087,"Rxe3":1088,"53.":1089," gxh5":1090,"Be7":1091," Rh4":1092," Rxe2":1093,"Rxa5":1094,"Qa5":1095," Kd4":1096," g3":1097," Ba4":1098," Qxd7":1099,"Kh5":1100,"Rh5":1101,"Ngf3":1102," Kf4":1103," Rh3":1104,"18.":1105," Rxf1":1106,"Qb7":1107," Qxd2":1108,"fxe6":1109," Rxc8":1110,"Red1":1111,"Qxh6":1112,"cxb4":1113,"Qxg6":1114," Rxa4":1115,"Nxc3":1116," Qa3":1117,"Bxf8":1118,"Qe8":1119,"54.":1120," cxb5":1121," Qxf3":1122," 74.":1123," Rxb3":1124," Nxg4":1125," Kb6":1126," Qh3":1127,"Rg6":1128," Qa8":1129,"Rxh7":1130," Qe1":1131," Qf3":1132,"gxh5":1133," Qxd1":1134,"Rxf3":1135,"Qxg5":1136,"Qxg4":1137," Qd1":1138," Nh4":1139," Qb2":1140," Qc1":1141," Rxc6":1142,"17.":1143,"Qc8":1144,"Rxb6":1145," cxd6":1146,"Bh5":1147,"Kxf2":1148," Bxb4":1149,"Qb6":1150," Qxg5":1151,"16.":1152," Nb3":1153,"Bc7":1154,"Rxg6":1155," Rxg2":1156,"Nxf3":1157,"axb6":1158,"Qxb6":1159,"Kb7":1160," Rxe6":1161," axb3":1162,"55.":1163," Nb7":1164,"fxg4":1165," Rxa3":1166,"Kb8":1167,"Bxg4":1168,"Bxb6":1169," Rg3":1170," Rxd7":1171,"Qxa7":1172," R8":1173," Rxb4":1174,"Rxb5":1175," Qxe6":1176,"Kc8":1177,"bxa5":1178," Ne2":1179," Nxf5":1180," 75.":1181," Rxf6":1182," Red8":1183,"Qxb5":1184," Qxe3":1185,"cxd6":1186,"Ba5":1187,"56.":1188,"Qa2":1189,"Ng2":1190," Nxb4":1191,"Bxb4":1192,"cxd3":1193,"Qxg7":1194,"15.":1195," hxg3":1196," fxg3":1197,"Rxe2":1198," Qb1":1199," Bxf2":1200,"Rde1":1201,"Nxb6":1202,"Qxb4":1203," Bb3":1204," Bc2":1205,"Rg":1206,"Rxb4":1207," Kc4":1208,"Rxa4":1209," Qf2":1210,"Kxf7":1211," Qxb3":1212,"14.":1213,"Ng6":1214,"Qb8":1215,"Ba6":1216," Qxb4":1217," Nc2":1218," Qxf2":1219," Bxh3":1220," Bxg3":1221," Bf3":1222,"13.":1223,"Ka2":1224," Qxf5":1225,"Rcd1":1226," Kc8":1227," gxh4":1228,"57.":1229,"Ng1":1230,"12.":1231," Qg3":1232," Qa1":1233," Nd2":1234," Nxe2":1235," Rxe7":1236,"Rxh5":1237,"Rxh6":1238," fxg5":1239," Kg4":1240,"Qxa6":1241," Qb3":1242," 76.":1243,"Nf7":1244,"Bg6":1245,"Qxh5":1246,"Nb2":1247," Bxb3":1248," Rxh2":1249,"Qa6":1250,"11.":1251,"fxg3":1252,"Rxa8":1253,"Kxf1":1254," Bxf1":1255," Rxg3":1256," Nxc6":1257,"Bh2":1258," Qxc2":1259," Rfb8":1260,"Bxd3":1261," Rxb5":1262,"exf4":1263," Rxa5":1264,"Qh8":1265,"58.":1266," Rg":1267,"Ndb5":1268," Ba3":1269," dxc6":1270," Qxd3":1271," Ba7":1272," Rcd8":1273,"gxh4":1274," Qxb5":1275,"Qh7":1276,"bxa4":1277,"Qxc7":1278," Ng3":1279," Qxe2":1280,"Qg7":1281,"10.":1282," d2":1283," 77.":1284," Bb8":1285," Qxg3":1286,"Ka1":1287," a2":1288," Rxc7":1289," Rhe8":1290,"Qa7":1291,"59.":1292,"Qf8":1293,"Bxd8":1294,"Qa8":1295," Bd2":1296," Bh7":1297," Be2":1298,"Rxc2":1299," Rxh4":1300,"Rxf2":1301,"Rxf1":1302," Nxf2":1303," Nxd7":1304," Kb5":1305," Rxb7":1306," c2":1307,"Bxh7":1308," cxb3":1309," Qxg4":1310,"Nce2":1311," Qxh4":1312," bxa5":1313,"dxc4":1314,"Qxh7":1315," Rxh3":1316," Raf8":1317," Ndf6":1318,"Rxg5":1319,"Bf7":1320,"Nxb7":1321,"Raf1":1322,"Rhd1":1323,"Na2":1324," Rxa1":1325," Qxb6":1326," Ba8":1327,"60.":1328," Bxa4":1329," Bxa3":1330,"Qxe8":1331,"cxb6":1332,"Rfb1":1333,"Qxa5":1334," 78.":1335," b2":1336," Qxa4":1337,"Bb7":1338," Rde8":1339," Nxg5":1340,"Bxc8":1341,"Kxd2":1342,"Qa1":1343," Rxa8":1344,"Kxg7":1345," Qh1":1346," Nxb2":1347,"Nxd2":1348,"Rxa1":1349," Rxg4":1350,"Bxe3":1351,"Kxf3":1352,"Rxb2":1353,"Nxc8":1354,"Bxd2":1355," Nxd6":1356," Bb2":1357,"Bf8":1358," e2":1359," Qxh3":1360," Qxa3":1361," Qa2":1362,"Rxb8":1363," Na7":1364,"Bxa7":1365," Rxa6":1366," Nf2":1367,"Ka3":1368," Qf1":1369," Bxh4":1370," Bg3":1371," Kxf7":1372,"61.":1373," Nbc6":1374," Qxb7":1375," 79.":1376,"Nxg4":1377," Rxe8":1378,"Nxb4":1379,"Nxc7":1380,"Nxg7":1381," Rxb6":1382," Kb4":1383," Nxe6":1384," Nxa4":1385,"Kxe2":1386,"Qh2":1387," Bf2":1388," Bxc2":1389," Nxb6":1390,"Ndf3":1391," Nxb5":1392," Bxd7":1393,"Bg1":1394,"Qxc2":1395," Ke3":1396,"N1":1397,"Bxh5":1398,"Qg8":1399,"Kxd8":1400," Kf3":1401,"Nxa5":1402," Qxg2":1403,"Nh6":1404," Rbc8":1405,"bxa6":1406," Rhd8":1407," gxf3":1408,"Rhg1":1409," Kd3":1410,"Bxc7":1411," Rxg5":1412," 10":1413," Kh5":1414,"Rxg4":1415,"gxh6":1416," 80.":1417," Bxh6":1418," Bxa2":1419,"62.":1420,"Rhf1":1421," Qxa5":1422," Rec8":1423,"Qxb3":1424,"Bg7":1425," Nxc2":1426," Rxb1":1427," Rxf7":1428,"Nxe2":1429," exf6":1430,"Rxb1":1431," Nxe7":1432,"Nxe3":1433,"Nxa4":1434," Kg3":1435,"Be8":1436,"Rxb3":1437,"Bxa5":1438," Kc3":1439,"Ka4":1440,"Kxf6":1441,"Rbc1":1442,"Qxb2":1443,"Kxe3":1444,"Rbd1":1445,"Kxf4":1446,"Rxa3":1447," Qh2":1448," Qg1":1449," h2":1450," Nxh5":1451," Qxc7":1452,"Nxd8":1453,"63.":1454,"Qxd1":1455," Rbd8":1456," dxe3":1457,"Nxf8":1458,"Nfd2":1459,"Qxc8":1460,"Ka6":1461,"cxb3":1462," Rxb8":1463,"Kxg3":1464," 81.":1465,"Rec1":1466,"gxh3":1467,"Ka7":1468,"bxa3":1469,"Kxh7":1470,"Qxa4":1471,"xf7":1472," bxa3":1473," Rxa7":1474," cxd3":1475," f2":1476," Nh":1477,"Nde2":1478,"xg7":1479,"Kxg4":1480," Rhg8":1481,"Ka5":1482,"Qxf8":1483,"Kxd1":1484," Kxf8":1485,"Bxa8":1486,"Nxd3":1487,"64.":1488,"Bd8":1489," gxh6":1490,"Rdc1":1491,"Kxe4":1492,"Qg1":1493," Rxh5":1494," Rxf8":1495," exd3":1496," Bxh2":1497,"Rxh4":1498," Rdc8":1499," exd6":1500,"Kxf5":1501," Kxe7":1502,"Bc8":1503,"Nxe8":1504,"Kxf8":1505," Bxc1":1506," Be1":1507,"Bxe2":1508," 82.":1509,"Kxg5":1510," Qh7":1511,"Qxc1":1512,"Nxa7":1513," Qg2":1514," Nh3":1515,"Nxh5":1516,"65.":1517,"Bxe8":1518," Qxh2":1519," Bc1":1520,"Qxe1":1521," Qg8":1522," Kb3":1523," Nce7":1524,"Nxb3":1525,"Ba1":1526," N8":1527," Rhf8":1528," Na":1529,"Nxh6":1530," bxa6":1531,"Kxg6":1532," N7":1533," Nbd5":1534,"Rdg1":1535,"Nxh7":1536," 83.":1537," Bxd1":1538,"Kxh2":1539,"Nb7":1540," Bh8":1541," Bxa6":1542,"66.":1543," Bd1":1544,"Rxa2":1545," Qxc8":1546," Nxa6":1547," g2":1548,"Kxe5":1549," Nb2":1550,"Qxf2":1551,"Nxh4":1552,"Kxd3":1553," Nxg2":1554,"Rdf1":1555," Bf1":1556,"Bxd1":1557,"Nbc3":1558,"Rxg8":1559,"exf7":1560," Rce8":1561,"Nxa6":1562," Kxf6":1563,"Kxd7":1564," fxe3":1565,"Ka8":1566,"67.":1567," Nxa2":1568," Nxh4":1569," 84.":1570,"Rce1":1571," Nxa5":1572,"Kxh5":1573,"Rxh8":1574,"Kxe7":1575,"Nh":1576,"Nxa8":1577," Bxa1":1578,"Bh7":1579,"Qxh4":1580," Bg8":1581," Bg2":1582,"Ne8":1583,"Kxd4":1584," Kh4":1585,"Bxa4":1586," Nxh3":1587," Ka7":1588," Qxe1":1589,"R5":1590,"68.":1591,"Qxa8":1592,"N2":1593," 85.":1594,"Qxg3":1595," Rbe8":1596,"Bxc1":1597," N6":1598," gxh3":1599," Kxe6":1600,"Na":1601,"Kxe6":1602," Nxc1":1603," Bb1":1604," Kxd7":1605,"Rbe1":1606," Nxf1":1607,"Rxg3":1608," Na3":1609,"Kxh3":1610," Rdf8":1611,"Kxh4":1612,"Bg8":1613,"fxg7":1614," Qxa8":1615," Rhc8":1616,"Nd8":1617," Nxd1":1618," Nxa3":1619,"R3":1620,"Kxh6":1621,"xg2":1622,"Ba7":1623,"Kxc4":1624," cxb6":1625," 86.":1626," Qxh5":1627,"Rdd1":1628," Qxc1":1629,"Bb8":1630,"69.":1631,"Bxb8":1632,"Nbd4":1633," Rdg8":1634,"Kxc3":1635," Rxh1":1636,"Kxd5":1637,"R6":1638,"R4":1639,"Kxe1":1640,"Nxg3":1641,"Nf8":1642," R4":1643,"Qxf1":1644," Rxg6":1645," Bg1":1646,"Kxc2":1647,"Rxg2":1648,"Nc8":1649," Nxg6":1650," Qh8":1651," Rxh6":1652,"Nxd1":1653," Bxe7":1654," Rxg1":1655,"Bxh3":1656," Ka8":1657,"Ree1":1658,"Kxc5":1659," Rxg7":1660," 87.":1661,"Rxh3":1662," Kxe5":1663,"Bxh4":1664,"70.":1665,"Qxg2":1666,"Bxb3":1667," Bxe1":1668," Rcc8":1669,"exf3":1670,"Qxa1":1671,"Ng7":1672," Kxd6":1673,"Kxb2":1674," Nfd5":1675," Qxd8":1676,"Na6":1677," Na8":1678," Nde5":1679," Bh2":1680," Ne1":1681,"xf2":1682,"Rhc1":1683," Ned7":1684," Bxa5":1685," Nec6":1686,"71.":1687,"Bh1":1688,"Kxb4":1689," Qxa1":1690,"Nce4":1691,"Bxc2":1692," Qxg6":1693,"Qxb8":1694," Qxa6":1695,"N3":1696," R5":1697," Nhf6":1698," 88.":1699," Ka6":1700," Nge5":1701," Qxf7":1702," Bxb1":1703," R6":1704," Nxe1":1705,"Nge4":1706," Bxb6":1707," Ree8":1708," a1":1709,"Qh1":1710," Nd1":1711,"Kxd6":1712," Rdd8":1713," Kf2":1714," Qxf1":1715,"Bxf1":1716," Kxf5":1717,"Rfa1":1718,"Na7":1719," Ka5":1720,"R7":1721," Nxh2":1722,"R8":1723,"dxc3":1724," Kh3":1725," N8d7":1726," Kxd8":1727,"Kxb5":1728," Nc1":1729," b1":1730," Kg2":1731," 89.":1732," Kxg6":1733," Kxg5":1734," Reb8":1735," Kxd5":1736,"Nfd4":1737,"72.":1738," Bxc8":1739," Kd2":1740," Ke2":1741," Rag8":1742,"Reb1":1743," Bxh5":1744,"Nxg2":1745," Rfa8":1746," Nxg7":1747," R2":1748," Kxh7":1749,"Nde4":1750," Qxg7":1751," Kc2":1752," Ba2":1753,"73.":1754," N5":1755,"Bxe1":1756,"Bxg3":1757,"Nbd7":1758,"Nh7":1759," Bxb7":1760," R3":1761," Nxc7":1762," 90.":1763," Nxa1":1764,"Kxg1":1765," Raa8":1766,"Nxa3":1767," Qxe8":1768," c1":1769,"Rxh1":1770," Rxh7":1771,"N5":1772," Kb2":1773,"Nec3":1774,"Nxe1":1775," Nce5":1776," Ncd7":1777,"gxf7":1778,"Rcc1":1779,"Rag1":1780,"Ref1":1781,"Kxc6":1782," Ndxe5":1783,"74.":1784," cxb2":1785," Kxh6":1786,"Kxa5":1787,"Kxb7":1788," Rxh8":1789," 91.":1790," Ka4":1791,"Bxb2":1792," Ng2":1793,"Qxa3":1794," Ngxe5":1795,"Nxc2":1796,"Bxa3":1797,"Kxe8":1798,"Raa1":1799,"Qxh8":1800," Kxf4":1801,"Nfe5":1802," N7f6":1803," Rff8":1804,"Nbxd4":1805,"Kxg8":1806," Bxc7":1807," Nef6":1808," Nxh6":1809," d1":1810,"Nbxd2":1811,"R1d2":1812,"Red2":1813,"Kxb3":1814," exf2":1815," Bxd8":1816,"75.":1817," Qxh6":1818," Ref8":1819," Qxf8":1820," Nxb7":1821," Kxh4":1822,"Nxc1":1823," fxg2":1824," Bxa8":1825,"dxe7":1826," 92.":1827,"Qxh3":1828,"Nce3":1829,"Nxb2":1830,"Rff1":1831," Nce4":1832," h1":1833," Qxb1":1834,"Ncd5":1835,"Nxb8":1836,"Rxg1":1837,"76.":1838,"Rxh2":1839," Kxe8":1840," N6d7":1841,"Nh1":1842," Nf1":1843," Bxg6":1844," R1":1845," Kxg4":1846," Kxc6":1847,"Kxb6":1848," Na2":1849," Nh8":1850,"Qxb1":1851," Rcb8":1852,"N1c3":1853," 93.":1854," Kxc5":1855," Qxb8":1856," e1":1857," Nbxd5":1858," Rbb8":1859,"Ned4":1860,"Kxa4":1861,"Neg5":1862,"Kxc7":1863," Rcf8":1864," Nfe4":1865," f1":1866,"Bxh8":1867," Ka3":1868,"hxg7":1869,"Rdh1":1870," Kxh5":1871,"cxb7":1872,"Bxa1":1873," Kxc7":1874," 94.":1875,"Bxf2":1876,"77.":1877," Nfxd5":1878,"Na1":1879," Kxe4":1880," Rdb8":1881,"Qxg8":1882," Bxf8":1883,"Nxh8":1884," Bxg7":1885,"Rde2":1886,"N4":1887,"exd3":1888,"Rdb1":1889," Ndc5":1890,"gxh7":1891," Rxg8":1892," Qxa7":1893," Kxc4":1894,"Kxa6":1895,"78.":1896,"Rcd2":1897,"Rbb1":1898," 95.":1899,"Ng8":1900,"Nxh3":1901,"Rea1":1902,"Rdd7":1903,"Ndxe4":1904,"Rdd2":1905," Nxd8":1906,"Nce5":1907," Ncxe5":1908,"exd7":1909,"10":1910,"Rcf1":1911," Raxc8":1912," g1":1913," Kxa4":1914,"Nb8":1915," Red7":1916,"N2f3":1917,"Nxf2":1918,"Rcb1":1919," Kxd4":1920," Rfxd8":1921,"R2":1922,"Kxc1":1923," 96.":1924,"79.":1925," Rbf8":1926," Kxb5":1927," Rcd7":1928," Kxb4":1929," axb2":1930," hxg2":1931,"Raxd1":1932,"dxc7":1933," N4":1934,"Qxa2":1935,"Rdc2":1936,"Ree2":1937,"Rbf1":1938," Rhb8":1939,"Bxg8":1940,"Nxf1":1941," Kxg3":1942,"80.":1943,"R1e2":1944,"fxe7":1945," Nh2":1946,"Rhb1":1947,"Kxa3":1948," Neg4":1949," Raxd8":1950,"Nfg5":1951,"Kxh1":1952,"N1d2":1953,"Rfd2":1954," Kxb7":1955," Qxh1":1956," Ree7":1957,"Rcc7":1958,"N1h2":1959," Rde7":1960,"Nhf3":1961," Nxc8":1962,"Rge1":1963," dxe6":1964," Kxh3":1965," Kxf3":1966," 97.":1967," R8d7":1968,"Bxg2":1969,"Ned2":1970," Kh2":1971," Rdd2":1972," Rdc7":1973," Nxf7":1974,"Kxa2":1975,"Ree7":1976," Bxf7":1977," Kxb6":1978," 98.":1979,"Raxc1":1980,"Rfe2":1981," Nb1":1982," Nde7":1983," Rea8":1984,"81.":1985," Rcc7":1986,"Ndc4":1987,"Rfxd1":1988," Nxe8":1989," Rfe7":1990," Ned5":1991," Nxf8":1992," R8c7":1993," Rdd7":1994," Rge8":1995," Kxb3":1996,"Ned5":1997," N5f6":1998,"Nfxd4":1999," gxf2":2000," Bxe8":2001,"Kxa7":2002,"Ncd2":2003,"Ncb5":2004," Rdh8":2005," Nxb1":2006," 99.":2007,"Rcc2":2008," Bxh1":2009," N7b6":2010," Kxh8":2011,"Ncxe4":2012," Rgf8":2013,"R1c2":2014," R7":2015," Nfxe4":2016,"axb7":2017,"N1e2":2018,"Red3":2019," Ncd4":2020,"Rgf1":2021," Rcc2":2022," Ndb4":2023," Kxa3":2024," Qxg1":2025," Rff7":2026," Nfg4":2027,"Rff2":2028," R8e7":2029,"Nxg8":2030," Rah8":2031,"Nef3":2032," Bxg1":2033," Nfe8":2034," Kxa5":2035," 100.":2036," Kxg8":2037,"82.":2038," Ree2":2039," gxh2":2040," Kxc3":2041,"Rah1":2042,"Nexd4":2043," Nac5":2044," Ka2":2045," dxc2":2046," bxc2":2047,"Rgd1":2048," Bxa7":2049," Nhf4":2050,"Nhf5":2051,"Kxh8":2052,"Nxa2":2053,"Nfd7":2054,"83.":2055,"Nxb1":2056," Nxh1":2057,"Ree3":2058,"Bxb1":2059," bxa2":2060,"Rda1":2061,"Rec2":2062," Ndc6":2063,"R1f2":2064," Rgd8":2065,"Ngxe4":2066," 101.":2067,"Ref2":2068," Nfe7":2069," Rec7":2070," Nac7":2071," Rfd7":2072,"Bxa2":2073,"84.":2074," Ref7":2075,"cxd7":2076," Rce7":2077,"R3d2":2078," Kxc8":2079," Nxb8":2080,"Rhh1":2081,"N5c3":2082," Nxa7":2083," Ba1":2084," Nac4":2085," Rhh8":2086," 102.":2087," Ncxe4":2088," Rca8":2089," cxd2":2090,"Nbxd7":2091,"Rdd3":2092,"Kxc8":2093,"xf8":2094," dxe2":2095,"Nfd5":2096," Rcg8":2097,"85.":2098,"Qxh2":2099," Ng1":2100,"Rfe3":2101," Ndf8":2102,"Rdf2":2103," Nexd5":2104," Rfg8":2105," 103.":2106," Kg1":2107," Nef5":2108," Rgg8":2109,"Rbb7":2110,"Rcg1":2111," Kxh2":2112,"Rce2":2113," Kxa6":2114," Nbc4":2115,"Bxh1":2116,"Rde3":2117,"Nfe2":2118," Kf1":2119,"Ndxb5":2120,"R3e2":2121," Nac6":2122," R8f7":2123," 104.":2124," Ke1":2125," Nxh7":2126," Rba8":2127,"87.":2128," Rbb7":2129,"Qxh1":2130,"bxc7":2131," Rab7":2132,"N2b3":2133,"86.":2134,"Ba8":2135," Rda8":2136,"R1d3":2137," Nce8":2138,"Nxh2":2139," Nxa8":2140,"Rfg1":2141," Nce6":2142,"Ndf1":2143,"xf1":2144," Rbc7":2145," Ncb4":2146," Bh1":2147," Kxa2":2148," Kxg2":2149,"N2c3":2150," Rbb2":2151,"N3d2":2152," N5b6":2153," Bxh8":2154,"Rfd3":2155,"Rba1":2156," N8e7":2157,"Rgg1":2158,"Nef4":2159,"88.":2160," Rac7":2161,"Ndc3":2162," 105.":2163," Reg8":2164,"Rca1":2165," Ncd5":2166,"Nac3":2167,"N1f3":2168," exd2":2169,"Rcd3":2170," Kxb2":2171," Raa2":2172,"89.":2173," Raa7":2174," fxe2":2175," Rdf7":2176,"Kxb1":2177,"Bh8":2178,"Nfe3":2179,"bxa7":2180,"Rff3":2181," Kc1":2182," Kxe3":2183," Nxg1":2184," Kb1":2185," Ncxd4":2186," Rgc8":2187,"Rfc2":2188,"Reg1":2189," Qxh7":2190,"Raa7":2191," Kd1":2192," 106.":2193,"Nfxe5":2194," Rbg8":2195,"R1e3":2196,"Nxa1":2197," Nfd4":2198,"Ngf5":2199," Kxf2":2200,"Nac4":2201,"Qxg1":2202,"N2g3":2203," Rcb7":2204," Rfc7":2205," Rae7":2206,"Ncd4":2207," Nec5":2208,"Ncxd5":2209," Qxh8":2210," Nfe6":2211," Ndb6":2212,"N4f3":2213," Kxa7":2214,"Ncxe5":2215,"Rbb2":2216," 107.":2217," N7c6":2218," Ndb8":2219,"Nec4":2220,"Nde5":2221,"R4d2":2222," Rbd7":2223,"Nac5":2224,"Rgc1":2225,"Rbc2":2226,"Rbg1":2227," Ree6":2228,"Rff7":2229," R6d7":2230,"90.":2231," Ned4":2232," 108.":2233," Rfxc8":2234," Rad7":2235,"N7":2236,"Rha1":2237," Ncb6":2238,"Rgf3":2239," Bxb8":2240," N8h7":2241,"Ref3":2242,"Rbd2":2243," Nba6":2244," Nfxd4":2245,"Ndf5":2246,"Rab2":2247,"Nde3":2248," R6e7":2249,"Ned3":2250," Nhf8":2251," Kxd3":2252," Raf7":2253," Rfe6":2254," R8b7":2255,"Nbc5":2256," 109.":2257,"N3h2":2258,"91.":2259,"Rfxf7":2260,"R3c2":2261," Red6":2262," Rdd6":2263,"Kxb8":2264,"Rcb2":2265," R6c7":2266,"Ncd1":2267," Rff2":2268,"Rce3":2269,"Rcc3":2270,"Ngxe2":2271," Rha8":2272," Rch8":2273,"Rdf3":2274," Kh1":2275,"Rec3":2276,"R3f2":2277," 110.":2278," Ncxd5":2279," Rcf7":2280," Rcd6":2281," Neg8":2282,"Nef5":2283," R6f7":2284,"N5f3":2285," Ndxc5":2286,"Rae2":2287," Nec7":2288," Nde4":2289," Ncd3":2290," Neg6":2291,"Nac2":2292,"92.":2293," Ka1":2294,"Na8":2295,"Rdd6":2296,"Rac2":2297,"Rdc3":2298,"R6d2":2299,"Rge3":2300,"Nhf1":2301,"Rhf3":2302,"Ncd3":2303," 111.":2304,"R1a2":2305,"R1c3":2306,"R4d3":2307,"Rad2":2308,"Raa2":2309,"Reh1":2310," Rbe7":2311,"Rbc3":2312," Rbc6":2313," Ned6":2314," R8c6":2315,"R5e2":2316,"Bxg1":2317,"Ndb1":2318,"Nfxd5":2319," Rff6":2320," Kxc2":2321,"R4e2":2322,"Nbd5":2323," Ncd6":2324," Rgf7":2325,"dxe3":2326," Rab6":2327," Rde6":2328,"Nfe1":2329,"R1b2":2330," R5d7":2331,"Rab3":2332,"Nge3":2333,"Rcf2":2334," Ned3":2335,"Ncb4":2336,"Rgh1":2337,"exf8":2338," 112.":2339," Ngf4":2340," Nef4":2341," N7g6":2342,"Raf2":2343," Rgh8":2344,"93.":2345,"Nxg1":2346," Rbxc8":2347," Na1":2348," Bxh7":2349," 113.":2350," Ncb8":2351,"R1g2":2352,"Rch1":2353," Nbd3":2354," Nbxd7":2355," R8e6":2356," Rfd6":2357,"Rbe2":2358,"Neg3":2359,"Rdb2":2360,"Ndb3":2361,"Nfd3":2362,"R5d2":2363," N4d5":2364,"R4f2":2365,"N3h4":2366,"N4b3":2367,"Nfe4":2368," R8a7":2369,"Kxa1":2370," Nge6":2371,"R8d7":2372," Rcc6":2373," Ndf4":2374,"R5e3":2375,"94.":2376,"Ngf1":2377,"Rfg2":2378,"Bxh2":2379," Nec4":2380," Rfg7":2381," Rdb7":2382,"R1d6":2383,"Ndxc4":2384,"Rgf2":2385," Rgf6":2386,"Ndf4":2387," Ngf8":2388," Rbf7":2389," R4c7":2390,"95.":2391,"Rhg2":2392," Nfg6":2393," Ncxe7":2394,"Nce1":2395,"R1f3":2396,"Ncb1":2397," R8g7":2398,"Rfh1":2399,"Ncxb5":2400," N3":2401,"Rhx":2402," Reh8":2403," N6d5":2404," N6h7":2405,"Nh8":2406," Rgb8":2407," R5f7":2408,"Rfg3":2409,"Rhg3":2410,"Nec5":2411,"97.":2412,"Kxa8":2413," 114.":2414,"Ncd6":2415,"R1d4":2416," R5e7":2417,"Rdd8":2418,"Reb2":2419," Rgg7":2420,"Rbd3":2421,"Rhg7":2422," R8d6":2423," Raxb8":2424,"Rhd3":2425," Rexd8":2426,"N6":2427,"Rfxe1":2428," Nxg8":2429,"Ned6":2430,"Rfxc1":2431," R4c6":2432,"R8e7":2433," 115.":2434," Rfxe8":2435,"Rhe3":2436," Reb7":2437," Rba7":2438,"Rgg2":2439," N6h5":2440," Rfb7":2441," Rfh8":2442," Ngxe7":2443,"Ndc5":2444," Rac6":2445," Rfxf2":2446," Qxg8":2447," Nde6":2448," 116.":2449," Kxb8":2450," R8f6":2451,"Rgb1":2452," Ndf5":2453,"R5c3":2454,"R5d3":2455,"R5c2":2456,"96.":2457," Ref6":2458," Rca7":2459,"Rgg7":2460,"Nhf4":2461,"Nab5":2462,"Nhg4":2463,"Nbd3":2464,"Rdd4":2465,"Rbh1":2466,"Nfg3":2467,"Nge5":2468,"Red4":2469,"Rba2":2470,"Rgx":2471," Nge4":2472,"Rdh2":2473,"R4f3":2474," N2":2475," Ree1":2476," 117.":2477,"Nbd6":2478,"Rcc6":2479,"Rcc8":2480,"Rgd3":2481,"Rexd1":2482,"Nfxd2":2483," N5c6":2484," Rbh8":2485," Nbc5":2486," Nbc8":2487,"N3e4":2488," R5d6":2489," R1d2":2490," Rfg6":2491,"Rdg2":2492," Rcc1":2493,"Ncxd4":2494," Nh1":2495,"Nxh1":2496," N8c6":2497," Rec6":2498," Rhg7":2499,"N3d4":2500,"Rfb2":2501,"Rbb3":2502," R5c7":2503,"N5e4":2504,"98.":2505,"xg8":2506," Nfd6":2507,"Ncb3":2508," Nab4":2509," Rgx":2510,"Ree6":2511,"R1e6":2512,"Nbc4":2513,"Rde4":2514," Rdc6":2515," Rcc4":2516," Rhh7":2517," Rbd6":2518,"Neg1":2519,"Rge2":2520,"R4e3":2521,"N8":2522," Nfg8":2523,"Rbf2":2524,"R8f7":2525,"Rac3":2526," Rdd5":2527," Rhg6":2528," Rcb6":2529,"Rcb3":2530," R8d5":2531,"Nbc1":2532,"Rhd2":2533," Nfe5":2534," Rce6":2535," Nab8":2536,"100.":2537,"N5d4":2538," 118.":2539,"Ree8":2540," Rcc3":2541,"Rca2":2542,"R7d6":2543,"dxe8":2544," Reg7":2545," Rdd1":2546,"Ndf2":2547,"R6d3":2548," R4e6":2549,"Rhxf1":2550,"Ree4":2551,"Rbb8":2552," Nec8":2553,"99.":2554," Rge7":2555,"Nab1":2556,"Nec1":2557,"R1d5":2558," Nhf5":2559,"Raa8":2560,"Nfxg5":2561,"R6d4":2562," R4e7":2563,"Nbxd6":2564," Ndxf6":2565,"Rgh3":2566," Nab6":2567," Rdd3":2568," Rcc5":2569," Rbb6":2570," R8c3":2571," Raa1":2572,"Rfd4":2573," Rdf6":2574," R8d3":2575,"Nab6":2576,"101.":2577," 119.":2578,"Rgd2":2579,"Rad3":2580," Nbd6":2581," Nxh8":2582," Rhx":2583,"Nhg5":2584," Nbd4":2585,"Rhh7":2586,"Rea2":2587," R4c5":2588," 120.":2589,"Rae3":2590," Rgg2":2591,"gxf8":2592,"R6d5":2593,"Nba3":2594,"R1c6":2595," Rge6":2596,"Raa3":2597,"Rfe4":2598,"Rhf2":2599,"Reg2":2600," Rhf6":2601," Ndc4":2602,"Nec2":2603," R8a3":2604," R8h7":2605,"Rgg3":2606,"Rfc3":2607,"Rhh2":2608,"R1e4":2609," R8c5":2610,"R4c2":2611," R6b7":2612,"R8c7":2613,"dxc8":2614," Kxa8":2615," Nhf7":2616," N8c7":2617,"Nbc7":2618,"Rda2":2619," Nfxg4":2620,"R1b3":2621," R8c4":2622,"Nhf2":2623,"exd8":2624,"Nac6":2625," R4f6":2626,"N3e2":2627," Rfe5":2628," Rea7":2629,"Ndc6":2630,"R1d7":2631," R8d4":2632," R4f7":2633," N4c6":2634,"Rdxd3":2635,"Rexe6":2636,"Ncxe2":2637,"Nexg5":2638," R1e2":2639,"Rab7":2640," Rbxb2":2641,"Rbxc1":2642,"Nef6":2643,"Naxc5":2644," R5f6":2645,"N4c3":2646,"fxe8":2647," Raxe8":2648,"Rff4":2649," Ree5":2650," Rba6":2651," Raa3":2652," R8b6":2653,"R5f3":2654,"R3b2":2655,"cxd8":2656," 121.":2657,"Nge6":2658," Rda7":2659,"R1h2":2660," Rgh7":2661,"Nge7":2662,"Rdb3":2663,"Ree5":2664," Kxe2":2665,"Ngxf7":2666,"Rhh3":2667,"Nfd1":2668,"R1c4":2669," R5e6":2670,"Raxe1":2671,"Rdxd4":2672," Rhh2":2673," Rbb1":2674,"102.":2675,"Rfh3":2676," Rff3":2677,"Rdxd5":2678," Nfh5":2679," Rdxd7":2680,"Rgf7":2681,"N1a2":2682,"N4g3":2683,"Raxa7":2684," Rfa7":2685,"Reg3":2686," Rhg2":2687,"Rcd4":2688,"R1a6":2689,"103.":2690," exf1":2691,"Nbc6":2692,"Rcc4":2693,"Rba3":2694," Ncd8":2695,"Neg4":2696,"R1a3":2697," Naxc4":2698," Rab2":2699,"Rdc4":2700," Ree4":2701," Rexe7":2702,"Nde6":2703,"R1e7":2704,"Rgxg7":2705,"Nexd5":2706,"Rdd5":2707,"Rcc5":2708,"R3a2":2709," R5c6":2710,"xh5":2711," Bxg8":2712,"Rhe2":2713,"Rexe7":2714," Rcd5":2715,"Nfxe6":2716," R8d2":2717," R4b7":2718," Nge8":2719," Rdd4":2720," Rcxd8":2721,"Rbxb7":2722,"Nfd6":2723,"Nfxd7":2724," Nexg4":2725," R3d7":2726,"Rdxd7":2727,"Red7":2728," Red5":2729,"Ncxd6":2730,"R1h7":2731,"R5d4":2732," N6e7":2733,"Raa6":2734,"Ndf6":2735," Naxc5":2736,"R5f2":2737,"R4c3":2738,"R2d3":2739,"xg1":2740," Raa6":2741,"Rbc7":2742,"Raxb1":2743," Rdxd6":2744,"Ndxe6":2745," R8e3":2746,"R5e4":2747," N4e5":2748," 123.":2749," 122.":2750," Nfd3":2751," Rbb3":2752,"Rbe3":2753," Nce3":2754,"Rgh2":2755," N6e5":2756,"R3g2":2757,"104.":2758," Rdg7":2759," Rhe6":2760,"Nfe6":2761,"Nec6":2762,"Naxc4":2763," R4d7":2764," R6a7":2765," Rgxg2":2766," Nexd4":2767," Rac5":2768,"Rfa2":2769," Rff4":2770," Rfd5":2771,"Rexe3":2772," Nfxd7":2773," Ree3":2774," Rbb4":2775,"Rbb6":2776," Rad6":2777,"Ngh5":2778,"Rdxd6":2779," Rce5":2780," Rcxc2":2781,"Rcg2":2782,"Rbd4":2783,"Ncb6":2784," R8e2":2785,"R6e2":2786," R6g7":2787,"R7e6":2788,"xh4":2789,"Rac4":2790,"Rexe4":2791,"Rcf3":2792," R8e5":2793,"Rag7":2794," Rff5":2795,"Ngxe6":2796,"Rhf4":2797," Nde3":2798,"Nfg1":2799," Kxd2":2800," Raxa2":2801," Nba4":2802," Rbd5":2803," Nexc5":2804," Nexf6":2805," Rac4":2806," Nbxc4":2807," Nge3":2808,"Rexe5":2809," Rca6":2810,"Rca3":2811,"Rcxc6":2812,"Nexf4":2813," R8c2":2814," Nhg7":2815," R2d3":2816,"xh6":2817," Ngf5":2818," Rdb6":2819,"Ndxe2":2820," Rgg6":2821," Rgf2":2822," Rgh6":2823,"N2c4":2824,"105.":2825," 124.":2826," cxd1":2827,"Ngf6":2828,"Rdf4":2829," Rexc8":2830," Rbxd8":2831," Ndxe7":2832,"Nfh5":2833,"R1f4":2834," R8g6":2835," bxc1":2836,"Rff6":2837,"Nbxc5":2838," Ngxf6":2839,"Ref4":2840," Ref5":2841," Rde5":2842," Rhf7":2843," Rbc5":2844," Nhg4":2845,"R7c6":2846,"Rdc7":2847,"Ndc2":2848," Rbe6":2849," Ndf7":2850,"R1g3":2851,"R1c5":2852," Nhxf4":2853," R5b7":2854,"R8d6":2855," N5g6":2856,"N5a3":2857,"106.":2858,"Rfe7":2859,"Rhh8":2860,"Rec4":2861,"Rcxc3":2862,"Rga1":2863,"Nac1":2864," R4d6":2865," R2c3":2866," R1c2":2867,"Rff8":2868,"Rfxf6":2869,"Rdg3":2870,"Rdxd2":2871,"Red5":2872," Rdxd4":2873," Rhf5":2874," Rca5":2875,"Rbc4":2876," R8e4":2877," Rgf5":2878,"107.":2879," 125.":2880," Kxd1":2881," Kxc1":2882,"Ngxf3":2883,"Ngh2":2884,"Rhg4":2885,"Nde7":2886,"Ned7":2887,"R1e5":2888," Rga8":2889," dxe1":2890,"Rdxe4":2891,"Reb3":2892," Rbb5":2893,"Rbg7":2894," Ndc3":2895," Neg7":2896," Rgd7":2897," R2d4":2898,"Nfxe4":2899,"xh7":2900," Rfh7":2901," Rhxf8":2902,"Rcxc7":2903," Rbxb7":2904," Nef8":2905,"R1a5":2906," R8a6":2907,"R5f4":2908,"R4b2":2909," R4d5":2910,"R7d5":2911,"Raf3":2912," Kxf1":2913,"Rbd7":2914,"Rgf4":2915," N7xf6":2916,"Nhg3":2917,"R6e5":2918," 126.":2919," Rff1":2920,"Rexd4":2921," gxf1":2922,"Ndxf3":2923,"Rcd7":2924," Nca6":2925," Rgc7":2926," N7e6":2927," N7c5":2928," R2e3":2929,"bxc8":2930," Rab5":2931,"Rce4":2932,"Nce6":2933," Ncb5":2934,"Ned1":2935," Nac8":2936," N6a5":2937," R4b6":2938,"R7f6":2939,"Rac5":2940," Rae6":2941,"Rfh2":2942," Ndxb4":2943," R8a4":2944,"Nhf6":2945," R2c4":2946,"108.":2947,"Rhd4":2948," Rexe5":2949,"Ndb4":2950," Rcxc3":2951," Nexc4":2952,"R1a7":2953," R4e5":2954,"Nexd6":2955," 127.":2956,"Ngxe5":2957,"Rexe2":2958," Rexe6":2959," Rdxd5":2960," Rcxc6":2961,"Nce7":2962," Ncxd3":2963," Nec3":2964,"R1c7":2965," Nhxf6":2966,"R6f4":2967,"R2e3":2968,"Rhxh7":2969,"Naxb5":2970,"hxg8":2971," Nfxe5":2972," Kxe1":2973," bxa1":2974," fxe1":2975," Ngh5":2976," Nfe3":2977," Reg6":2978,"Rbb5":2979,"Nfg4":2980," Nef3":2981," Nac3":2982," R3d5":2983,"Qc":2984," 128.":2985," Raa4":2986," Rec5":2987," Rdc5":2988," Rdh7":2989,"Nde1":2990," Ncxb4":2991,"Nexd2":2992," R8b3":2993,"N1c2":2994,"R5c4":2995,"Nab3":2996,"R6c2":2997," R4f5":2998," R3d4":2999," R3c7":3000," dxc1":3001,"Rad4":3002,"Rab4":3003,"Rfxf5":3004," Rcxc4":3005," Rba5":3006,"Nexf7":3007,"R1xd4":3008,"Rgc2":3009,"Rgg8":3010," Nab7":3011,"N3a4":3012," R5a6":3013,"axb8":3014," Rag2":3015," Raa5":3016,"Rff5":3017," Rfe2":3018," Rcg7":3019,"Rbxb2":3020,"Ncd7":3021," Ndc7":3022," Nca4":3023,"Nef1":3024,"Nhxf5":3025,"R5g3":3026,"R8g7":3027,"N7d5":3028," Nexf5":3029,"Raxa6":3030," Ngh6":3031," Kxg1":3032," Nfd8":3033," Red2":3034," Rcb5":3035,"Rcxc4":3036," Rbc2":3037," R8h3":3038," R8h2":3039,"R6f3":3040,"Ndxe5":3041,"Raa4":3042," Rab4":3043," Rac2":3044," Rhe7":3045,"Ndb2":3046,"Rcxc5":3047," N7a6":3048,"Nhg2":3049,"Nab2":3050,"R6e4":3051,"R6c5":3052,"R7d2":3053,"109.":3054,"xh3":3055," Qc":3056," exd1":3057," Rfh6":3058,"Rhc3":3059,"Rec7":3060,"Rea3":3061,"Reh2":3062," Rexe2":3063," Rhh1":3064," Rcxc5":3065,"Rcxd1":3066,"Rbb4":3067,"Nexc4":3068,"R1b6":3069,"Rgh4":3070," R1d3":3071,"110.":3072,"Nexf5":3073,"Qa":3074," Raxa4":3075,"Rfh4":3076," Rfxf3":3077,"Ngf4":3078,"Ngxf5":3079,"Ncxe6":3080," N8g6":3081,"R6f2":3082,"R8b7":3083,"Qb":3084,"Raxc8":3085,"Rfxf3":3086," Rcd2":3087,"Rcd5":3088,"Rgg6":3089," Nhg5":3090," N8a7":3091,"R6f5":3092," R2a3":3093," R3f5":3094," R3b7":3095," Rfe4":3096,"Ngh3":3097," Nfg5":3098," Rexe4":3099," Rexe3":3100," Rhd7":3101," Rbc4":3102," R8b5":3103,"Rgf5":3104," Rgd6":3105," Nhg6":3106,"R6c4":3107," R2c7":3108," R3e4":3109," R3e7":3110,"Qd":3111,"Rab5":3112,"Rfd5":3113,"Rfb3":3114," Ngh7":3115,"Rexd3":3116," Rdxd2":3117," Rdxc8":3118," Rbg2":3119," Ndf3":3120,"Nexd7":3121," R8f5":3122," R8b2":3123,"Rge7":3124," Rge5":3125," R2e4":3126," Kxb1":3127,"Raxa5":3128,"Rfe5":3129,"Nba5":3130,"Rhe7":3131," Rca4":3132," Rcxd6":3133,"Rcb4":3134,"Rbf3":3135,"R1h3":3136,"R1h6":3137,"Rge4":3138," Rgf4":3139," N8e6":3140,"R7b6":3141," R1h2":3142,"114.":3143,"Rexd5":3144," Qf":3145,"Rab6":3146,"Rfd7":3147,"Rfxf2":3148," Ngxe4":3149,"Rdh3":3150," Rdc2":3151,"Ndc7":3152," Rcxd7":3153," Rcxc7":3154,"Rce5":3155,"Rcg7":3156,"Rcd6":3157,"Rbd6":3158,"Nca3":3159,"R1b7":3160,"N1e3":3161,"N1f2":3162," Nhg8":3163," N8f6":3164,"R5a2":3165,"R6e3":3166,"R6a5":3167,"R4a3":3168,"R7e5":3169,"R8a7":3170," R1f2":3171," Rhxh2":3172,"112.":3173,"111.":3174,"fxg8":3175," Qb":3176," axb1":3177,"Rad7":3178,"Raa5":3179,"Rfg4":3180,"Rdxf7":3181,"Rexc1":3182," Rdc4":3183," Rhe2":3184,"Ndxf5":3185,"Rca4":3186,"Rcxc2":3187,"R1a4":3188,"R1b4":3189," R8b4":3190," Rgg3":3191," N7e5":3192," R4b5":3193,"R7d3":3194,"R8h7":3195," R1b2":3196," N4a5":3197,"bxa8":3198," 130.":3199," 129.":3200," Kxa1":3201," Nbxc6":3202," Ngxf2":3203,"Rhe4":3204,"Rdf7":3205,"Rdxe3":3206," Red4":3207," Rec2":3208," Rde4":3209," Rcd4":3210," Rbd2":3211,"R1xd5":3212,"R5b4":3213,"R5b2":3214," N6xd5":3215,"R7d4":3216,"R7a6":3217," R3c4":3218," R1a2":3219,"Rae7":3220,"Rac6":3221,"Rac7":3222," Rfxf4":3223," Rfxe6":3224,"Ngxe7":3225,"Rdc6":3226," Rhh6":3227,"Rca5":3228,"Rgc3":3229," Nab3":3230,"R5b3":3231,"N2e3":3232,"N3xd4":3233,"R7c5":3234," R3d6":3235," R3b5":3236," cxb1":3237,"Raf7":3238,"Rhf5":3239," Rhg5":3240," Rcg2":3241,"Nca4":3242," Ndxe4":3243,"R5a3":3244," R5b6":3245," R5a7":3246,"R7e2":3247,"R7c2":3248," R2b3":3249," R3f6":3250," R3f4":3251,"R2c3":3252,"Qh":3253,"Rcxd5":3254,"cxb8":3255," Rcxd4":3256," Rad2":3257," Rfxb8":3258," Nbc7":3259,"Nbxd5":3260,"Ngf7":3261,"Rhd7":3262,"Rhg5":3263," Rhg4":3264," Rhd5":3265," Rhh3":3266," R8a2":3267,"Rgd4":3268,"Rgd7":3269,"Rgxg6":3270," R3f7":3271,"115.":3272,"Qe":3273," 131.":3274," Rcxd5":3275," Raxa7":3276,"Rfxf4":3277,"Ngf2":3278," Ngf3":3279,"Rde5":3280," Rexd6":3281," Rdf5":3282," Rcf6":3283,"Rcb7":3284,"Rba4":3285,"Rbxd1":3286,"Nfh2":3287,"Nef2":3288,"R1xe4":3289," R8f4":3290," N8d6":3291," R5g7":3292,"R8e6":3293," R3c5":3294,"R2d4":3295," N4xd5":3296," N4h5":3297," Qe":3298," Rag7":3299," Nbxd3":3300," Kxh1":3301,"Red6":3302," Rhe5":3303," Rhh4":3304,"Rcf7":3305," Rbxb6":3306,"Rbc5":3307,"Rbxb4":3308,"Rbxb6":3309," Ncb3":3310,"Nfh4":3311,"R1f6":3312,"R1b5":3313,"N1g3":3314," Nhf3":3315,"N2e4":3316," R3c6":3317," R7e6":3318," Rexd5":3319,"Rae4":3320," Raf6":3321," Rab3":3322," Raxa3":3323,"Rhc2":3324,"Rhg8":3325,"Rdg7":3326,"Rdb6":3327," Reb6":3328," Rdb5":3329,"Ndxf7":3330," Rce4":3331," Rbd4":3332,"Rbd5":3333,"Ncxb4":3334," R8h4":3335," R8a5":3336," Rge2":3337," Rgg1":3338,"R4a2":3339,"N3g4":3340,"R2f3":3341," R7c6":3342,"N8c6":3343,"Ndxc5":3344,"Rdxe5":3345," 132.":3346,"Rfe6":3347," Rfxf5":3348," Nbc2":3349," Ngxf4":3350,"Rhf7":3351,"Reh3":3352," Rec4":3353," Rcd3":3354," Rcb4":3355," R8h6":3356," Rgg4":3357," N8a6":3358," R3b4":3359," N4a6":3360,"Rcxd4":3361,"xh2":3362,"Rad6":3363," Ngf7":3364,"Rhh4":3365,"Rdc5":3366,"Rdxe2":3367,"Rdxf1":3368," Reh7":3369," Rdg6":3370," Rhg1":3371," Rbxb5":3372,"Rbf7":3373,"Nfxd6":3374,"Nexc5":3375,"R1h4":3376,"Rge5":3377,"N1d3":3378,"R5h2":3379,"R6c3":3380,"R4b3":3381,"113.":3382," Rae2":3383,"Rfc7":3384," Rfc6":3385," Nbxd4":3386,"Nba4":3387,"Rhg6":3388,"Rdf6":3389,"Rdxc4":3390,"Rda3":3391," Rdxd3":3392,"Ndb6":3393,"Ndxf6":3394,"Rce7":3395," Rbf2":3396,"Rbe7":3397," Ndb5":3398," Ndb7":3399," Nexf4":3400," N8g7":3401," Nab5":3402,"R4g3":3403," R4g6":3404,"R7g6":3405,"N4f5":3406," hxg1":3407," Rac3":3408," Rad5":3409,"Rfg7":3410,"Rde6":3411," Rexd7":3412," Rhh5":3413,"Nfe7":3414,"R1h5":3415," R8xd5":3416,"Rgf6":3417," Rgh5":3418," Rgxg3":3419,"Nhg1":3420," N6c5":3421," R2e7":3422," R2d5":3423,"116.":3424," 133.":3425," Rfh5":3426,"Rdxe6":3427,"Ref5":3428,"Rec5":3429,"Rexd2":3430," Nfe2":3431," Rhf4":3432,"Ndxf4":3433,"Rcxd3":3434," Rbxb3":3435," Ndxe3":3436," Nca5":3437,"Rgg5":3438," N6g5":3439,"Nab4":3440,"R6xd5":3441,"R4h2":3442," R4a7":3443,"N3c4":3444," R5g6":3445," R6h7":3446,"R7c3":3447," R2f3":3448," R3a4":3449," N4c5":3450," Qd":3451," Rfg5":3452," Rfc2":3453,"Ref7":3454,"gxh8":3455," Rdf4":3456," Rdg2":3457," Rce2":3458,"Rch2":3459," Nde8":3460," R8h5":3461," R8xd7":3462,"Nhg6":3463,"R5g4":3464,"R5a4":3465,"R6a2":3466," R4g7":3467," R2d7":3468,"119.":3469,"Qf":3470," 134.":3471," Qa":3472," Raxa6":3473," Rfd2":3474,"Rexf3":3475," Red3":3476," Rde2":3477," Rdxe4":3478," Rdxe6":3479," Rhg3":3480," Rcf2":3481,"Rcg3":3482," Rbxb4":3483,"Rbxb5":3484," Nde2":3485,"Nfg6":3486," Nexc6":3487,"Neg2":3488,"R1f5":3489,"R1f7":3490,"Rgg4":3491,"Nhxf6":3492,"R4g2":3493,"N3xe4":3494,"R7e4":3495,"R7e3":3496," R3e6":3497," R7d6":3498," Rdxe5":3499,"Rfxe4":3500,"Red8":3501," Rhf3":3502," Rcxe4":3503," Rbe2":3504," Rbg7":3505,"Rbc6":3506," Ncxe3":3507,"Nexc3":3508,"R1xe5":3509," R8f3":3510,"R5xd4":3511," N6xe5":3512," R4a5":3513,"N3d5":3514," R2e5":3515," R3e5":3516," R7g6":3517,"117.":3518,"Rad5":3519," Raf2":3520," Raxa5":3521,"Rfxe3":3522," Rfxf6":3523," Rfxf7":3524,"Nbd1":3525,"Nge1":3526,"Ngxf6":3527," Ngh4":3528,"Rhf6":3529,"Rdxf6":3530,"Rdxc1":3531,"Reg4":3532," Rcf4":3533,"Nef7":3534,"N1g2":3535,"R3h2":3536,"R6b4":3537,"R6b2":3538," R2c6":3539," R2d6":3540," R2b7":3541," N5e6":3542,"N5a4":3543,"Nexf6":3544," 135.":3545,"Rag2":3546," Rfxe5":3547," Rfb2":3548," Nba5":3549,"Rhh6":3550,"Rdxc3":3551," Rexd4":3552," Rhd2":3553," Rba4":3554,"Rbxc6":3555," Ndxc4":3556," Nef7":3557,"R1xc5":3558,"R1xd3":3559,"R1xd2":3560," R8xd6":3561,"Rgb2":3562," Rgg5":3563,"N1xd2":3564," Naxc3":3565,"R5g2":3566,"R2e4":3567,"118.":3568,"Q8":3569,"Rdxc5":3570,"Raxa4":3571," Raxd7":3572,"Rfxe2":3573," Nbd8":3574,"Nbxc3":3575,"Rdb4":3576,"Rdxc6":3577,"Rdxe1":3578," Nfh7":3579," Reb5":3580," Rdxf8":3581," Rhd6":3582," Rbf6":3583,"Rbg2":3584,"Ncxd7":3585," Ndxf5":3586," Ncb7":3587,"Nexc6":3588," R8f2":3589,"Rgxg5":3590," Rgd2":3591," Nhxf5":3592," N6f5":3593,"R6g4":3594,"R6b5":3595,"R7f4":3596," R2b6":3597," R3a6":3598," N4xe5":3599,"Rhxh6":3600,"Naxb6":3601,"Qg":3602," N1":3603," Nhxg4":3604," Naxb3":3605," Qh":3606," Raxc4":3607," Raxc5":3608,"Rfh5":3609,"Rfa3":3610," Rfd3":3611," Nbc3":3612,"Rde7":3613,"Reg7":3614,"Reb4":3615," Nfxe3":3616," Rea6":3617," Rda5":3618," Rhc7":3619,"Ndxc6":3620,"Rcb5":3621,"Rcxd6":3622," Ndxb6":3623," Nexd3":3624,"R1g6":3625,"R1xc3":3626,"R1xc2":3627," Rgc2":3628," R4g5":3629,"R7c4":3630,"R8d2":3631," R3b6":3632," 136.":3633," Qg":3634," Rfg2":3635," Rfxd7":3636,"Nbc2":3637,"Rda4":3638,"Rexf4":3639," Reg2":3640," Rda6":3641," Rdxc7":3642,"Ndc1":3643," Rbd3":3644," Rbxc4":3645,"Rbxb3":3646,"Nca5":3647," Nce2":3648," Neg5":3649,"Rgc7":3650," Rgc6":3651," N8f7":3652,"N2xf3":3653,"R6h2":3654," R5h6":3655,"R8c6":3656,"R8d5":3657," R2b4":3658," R2h3":3659," R2xb3":3660," R3g5":3661,"N5h4":3662,"Rae5":3663,"Raxc6":3664," Raxb6":3665,"Rfb7":3666,"Rfxe6":3667," Rfe3":3668," Rfxe7":3669,"Rhe5":3670,"Rhxc8":3671,"Rdxd1":3672," Ref4":3673," Rcb2":3674,"Rca6":3675,"Rcxd2":3676,"Rbxd5":3677," Ned8":3678," Nexf3":3679," R8xe4":3680," R8xc5":3681," Rge4":3682," N6c7":3683,"R6h4":3684,"R6h5":3685,"R8d3":3686," N5f4":3687,"R2c4":3688,"Nhxg6":3689,"Rfg5":3690,"Rfxd2":3691," Rfa6":3692," Nbxa4":3693," fxg1":3694,"Rdb5":3695,"Rdb7":3696,"Rdxc2":3697," Red1":3698," Ref2":3699," Reb2":3700," Rhf2":3701,"Ndxe7":3702,"Rbe4":3703," Ndxf2":3704,"Nexf3":3705,"R1g4":3706,"R1xd6":3707," Nhg3":3708," N8b6":3709,"Nac7":3710,"R6b3":3711,"R7f3":3712,"R8d4":3713,"R8e5":3714,"R8c5":3715,"N5c4":3716,"N4b5":3717,"R2d7":3718,"N8d7":3719,"Rbxc3":3720,"Rad8":3721,"Rab8":3722,"Raxd6":3723," Raxb2":3724," Raxf8":3725,"Rfc4":3726,"Rfd6":3727," Rfd4":3728,"Rhh5":3729,"Rdf5":3730," Rdb4":3731," Rdxe8":3732," Rbc3":3733," Rbe1":3734," Ndxf4":3735,"Nfh3":3736," Ned2":3737,"R1xc4":3738,"R1xf2":3739,"Rgf8":3740," Rgb7":3741,"Nhf7":3742,"R5h4":3743,"N2d4":3744,"R6g5":3745," R2e6":3746," R3a7":3747,"R2a3":3748,"120.":3749,"Nhxg5":3750," 140.":3751," Rexf5":3752,"Raxc5":3753,"Raxb5":3754,"Rfxd4":3755,"Rfxb1":3756," Rfc5":3757," Rfb6":3758," Rfxd6":3759,"Nbxc7":3760,"Ngh4":3761,"Rhd5":3762,"Rhc7":3763,"Rdh4":3764,"Rexf5":3765,"Rexe8":3766," Ref3":3767," Reh6":3768," Rdg5":3769," Rdxc4":3770," Rdxc6":3771,"Ndf7":3772," Rcb3":3773," Rcxe5":3774,"Rce6":3775,"Rcd8":3776," Rbe4":3777," Rbxc6":3778,"Ncxe7":3779," Ncd2":3780,"Nfxg6":3781,"Neg6":3782,"R1g7":3783," R8g5":3784," R8xc7":3785,"Rgd6":3786," Rgd5":3787," Rgf1":3788," N8xd7":3789," N7d5":3790,"R3d4":3791," R4h5":3792,"R7xc6":3793," R2f4":3794," R7f6":3795,"N7e5":3796,"Rgxf1":3797," 137.":3798," Rdxc5":3799," Rad4":3800," Rae5":3801," Raxd6":3802,"Rhxg6":3803,"Rdg4":3804,"Rec6":3805,"Reb7":3806," Reh5":3807," Rde3":3808," Rdf2":3809,"Ndxc3":3810," Rca3":3811," Rcxb4":3812,"Rcxc1":3813," Rbe5":3814,"Rbg3":3815,"Rbe8":3816,"Rbxa4":3817," N6b5":3818,"R4xd3":3819," R4a6":3820,"R8e2":3821," R1c3":3822,"Rhxh5":3823," N2c4":3824," 138.":3825," 142.":3826," Naxb4":3827,"Raxb7":3828,"Raxa2":3829,"Raxf7":3830," Raxc3":3831,"Rfxc3":3832," Rfxd5":3833," Rfh4":3834,"Rhb3":3835,"Rhxe6":3836,"Rdxd8":3837," Nfg7":3838," Nfxe6":3839," Reg5":3840," Rdxf4":3841," Rdxe3":3842," Rdxe7":3843," Rhe4":3844," Rcf5":3845," Rch7":3846,"Rcf4":3847,"Rcxf7":3848,"Rbxa5":3849," Ndc8":3850,"Nec7":3851," R8xe6":3852," R8xb7":3853,"Rge8":3854,"Rgh5":3855,"Rgxg4":3856,"Nhxf3":3857,"R4h3":3858," R4h7":3859,"N3a2":3860," R5h7":3861," R2a4":3862," R3g7":3863,"R2d6":3864," R7d5":3865," R7c5":3866,"122.":3867,"121.":3868," 139.":3869," 144.":3870," Nexd6":3871,"Raxb6":3872,"Rah2":3873," Rab1":3874," Raxb4":3875," Ngxf3":3876," Ngxe3":3877,"Rhe6":3878,"Rhxf7":3879,"Reh4":3880," Nfh4":3881," Rdc3":3882," Rdh6":3883," Rdb2":3884," Rhc2":3885," Rhxd8":3886," Rhxc8":3887," Rce3":3888," Rcxc8":3889," Rbxe8":3890," Ndb3":3891," Ndxe6":3892," Ncxb3":3893," Nexd7":3894,"R1xf4":3895," R8g2":3896," R8xe7":3897,"Rga3":3898," Rgf3":3899," Rgc5":3900," N7d6":3901,"N2d3":3902,"R6xd4":3903,"R6xe5":3904," R4xd5":3905,"R7b3":3906,"R7b4":3907,"R7h6":3908,"R7a2":3909,"R8e4":3910," R2g3":3911," R3a5":3912,"N5xd4":3913," R1e3":3914," R1d5":3915,"N4e3":3916,"R2b3":3917," N4f6":3918,"N7b5":3919," N3c5":3920," 141.":3921,"Raxf1":3922," Rad3":3923," Rad1":3924," Raxb7":3925," Raxc7":3926," Rfc3":3927," Rfxd4":3928,"Nbxa5":3929,"Rhxe4":3930,"Rhb7":3931,"Rhxf5":3932,"Rhb2":3933,"Rhxf8":3934,"Rda5":3935,"Rea4":3936,"Rexc3":3937,"Rexc2":3938," Reb4":3939," Rdf3":3940," Rdxd8":3941," Rdxf2":3942," Rcxe7":3943," Rcxf2":3944,"Rcf5":3945,"Rcxe4":3946,"Rcxe1":3947," Ndxc3":3948," Ncxd7":3949," Nef2":3950," R8g4":3951," R8xb5":3952,"Rgd5":3953,"Rgb3":3954,"N1b2":3955,"Nhxf4":3956,"Nhxf7":3957,"N2a3":3958,"N2xb3":3959,"Naxc6":3960," R4xb5":3961,"N3b4":3962,"R8f6":3963," R2f6":3964," R2g4":3965," R2a7":3966," R3h4":3967," R1e4":3968,"R2d5":3969," N4f5":3970," R7d3":3971," N2d4":3972," Rhxh4":3973,"124.":3974," 143.":3975," Ncxb5":3976," Nhxg3":3977," Rbxc3":3978,"Raxd8":3979,"Raxa3":3980," Rac1":3981," Raxc6":3982,"Rfxe5":3983," Rfc4":3984,"Nbxc4":3985," Ngxe6":3986,"Reg5":3987,"Rexe1":3988," Nfh6":3989," Rec3":3990," Reg4":3991," Ref1":3992," Rdb3":3993," Rdh5":3994," Rhe1":3995,"Rcxe5":3996,"Rch3":3997," Nexc3":3998," Nexf2":3999,"R1xc6":4000,"R1xe2":4001," R8g3":4002," R8xc6":4003,"R3f4":4004,"R6a4":4005,"N3f4":4006,"R7f2":4007," R2a5":4008," R3g6":4009,"N5xe4":4010," R1c7":4011," R1g2":4012," R7b6":4013," N3f4":4014,"125.":4015,"123.":4016,"Rgxf7":4017," 145.":4018,"Raxd5":4019,"Rac8":4020,"Raxb4":4021,"Raxb3":4022,"Rfe8":4023,"Rfxd3":4024,"Rfxf1":4025," Rfxf8":4026,"Rhxf6":4027,"Rexc4":4028,"Rexd6":4029,"Rexf7":4030," Rexe8":4031," Rexc7":4032," Rdxc3":4033," Rhd4":4034,"Rcxb2":4035," Rbxe4":4036," Rba3":4037," Rbxd6":4038," Rbxa5":4039," Rbxf2":4040,"Rbxd4":4041,"Rba5":4042," Ndxf3":4043," Ncxb6":4044," Neg3":4045," R8xd4":4046," R8xe3":4047,"Rgb7":4048,"Rga2":4049," Rgd4":4050," Naxc6":4051," N7f5":4052,"R5h3":4053,"R6g2":4054,"R6a3":4055,"R7b5":4056," R2f7":4057," R2xc3":4058," N5xf6":4059," R1d4":4060," R1d6":4061,"R2e6":4062," Rgxf8":4063," Q1":4064,"Raf8":4065,"Raxc4":4066,"Rag8":4067," Raf4":4068," Raxd4":4069," Raxb3":4070,"Rfg6":4071,"Rfxg6":4072,"Rhxg5":4073,"Rdg6":4074,"Ref6":4075," Nfg3":4076," Nfxg3":4077," Rea5":4078," Rexf7":4079," Rde1":4080," Rhb7":4081,"Ndxc7":4082," Rcg5":4083," Rcxf4":4084,"Rcxe6":4085,"Rcxe3":4086," Rbc1":4087," Rbh7":4088,"Rbe5":4089,"Rbxe6":4090,"Rba6":4091,"Rbxe3":4092,"Rbxd2":4093,"Rba7":4094," Ncxe6":4095}